Revit 2026 API

# UIFabricationUtilsSetOpenConnectorIndicatorTowardsColor Method

---

Sets the color of the open connector indicator in towards direction

**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static void SetOpenConnectorIndicatorTowardsColor(
	Color color
)
```
```vb
Public Shared Sub SetOpenConnectorIndicatorTowardsColor (
	color As Color
)
```
```cpp
public:
static void SetOpenConnectorIndicatorTowardsColor(
	Color^ color
)
```
```fsharp
static member SetOpenConnectorIndicatorTowardsColor :
        color : Color -> unit
```

#### Parameters

color Color

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

#### Reference

UIFabricationUtils Class

Autodesk.Revit.UI Namespace